IDENTIFICATION DIVISION.
       PROGRAM-ID. QUESTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CREATED-AT      PIC X(20).
       01 WS-UPDATED-AT      PIC X(20).
       01 WS-IS-DELETED      PIC X(1) VALUE 'N'.
       01 WS-DELETED-AT      PIC X(20).
       01 WS-QUESTION-ID      PIC 9(5).
       01 WS-QUESTION-TEXT    PIC X(255).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           MOVE FUNCTION CURRENT-DATE TO WS-CREATED-AT.
           MOVE FUNCTION CURRENT-DATE TO WS-UPDATED-AT.
           DISPLAY 'Question Created'.
           STOP RUN.