IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CREATED-AT      PIC X(20).
       01 WS-UPDATED-AT      PIC X(20).
       01 WS-IS-DELETED      PIC X(1) VALUE 'N'.
       01 WS-DELETED-AT      PIC X(20).
       01 WS-CALCULATION-ID   PIC 9(5).
       01 WS-CALCULATION-RESULT PIC X(100).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           MOVE FUNCTION CURRENT-DATE TO WS-CREATED-AT.
           MOVE FUNCTION CURRENT-DATE TO WS-UPDATED-AT.
           DISPLAY 'Calculation Created'.
           STOP RUN.