IDENTIFICATION DIVISION.
       PROGRAM-ID. INVENTORY-MANAGEMENT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEMS.
           05 ITEM-ID PIC 9(5).
           05 ITEM-NAME PIC X(20).
           05 ITEM-QUANTITY PIC 9(4).
       01 ITEM-INDEX PIC 9(5) VALUE 0.
       01 ITEM-LIMIT PIC 9(4) VALUE 1000.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM INITIATE-ITEMS
           PERFORM DISPLAY-ITEMS
           STOP RUN.
       INITIATE-ITEMS.
           MOVE 1 TO ITEM-ID
           MOVE 'Widget' TO ITEM-NAME
           MOVE 500 TO ITEM-QUANTITY.
       DISPLAY-ITEMS.
           DISPLAY 'ITEM ID: ' ITEM-ID
           DISPLAY 'ITEM NAME: ' ITEM-NAME
           DISPLAY 'ITEM QUANTITY: ' ITEM-QUANTITY.