IDENTIFICATION DIVISION.
PROGRAM-ID. SecurityModule.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PASSWORD PIC X(20).
01 WS-ENCRYPTED-PASSWORD PIC X(20).
PROCEDURE DIVISION.
    DISPLAY 'Enter Password: '.
    ACCEPT WS-PASSWORD.
    PERFORM 500-ENCRYPT-PASSWORD.
    DISPLAY 'Encrypted Password: ' WS-ENCRYPTED-PASSWORD.
    STOP RUN.

500-ENCRYPT-PASSWORD.
    MOVE FUNCTION REVERSE(WS-PASSWORD) TO WS-ENCRYPTED-PASSWORD.