IDENTIFICATION DIVISION.
PROGRAM-ID. DatabaseModule.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-DB-CONNECTION PIC X(50).
01 WS-SQL-QUERY PIC X(100).
PROCEDURE DIVISION.
    PERFORM 200-OPEN-CONNECTION.
    PERFORM 300-EXECUTE-QUERY.
    PERFORM 400-CLOSE-CONNECTION.
    STOP RUN.

200-OPEN-CONNECTION.
    MOVE 'DB-CONNECTED' TO WS-DB-CONNECTION.
    DISPLAY 'Database connection opened.'.

300-EXECUTE-QUERY.
    MOVE 'SELECT * FROM USERS' TO WS-SQL-QUERY.
    DISPLAY 'Executing query: ' WS-SQL-QUERY.

400-CLOSE-CONNECTION.
    MOVE 'DB-CLOSED' TO WS-DB-CONNECTION.
    DISPLAY 'Database connection closed.'.