IDENTIFICATION DIVISION.
PROGRAM-ID. MainProgram.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-USER-ID PIC 9(5).
01 WS-USER-NAME PIC X(20).
01 WS-USER-AGE PIC 99.
PROCEDURE DIVISION.
    DISPLAY 'Enter User ID: '.
    ACCEPT WS-USER-ID.
    DISPLAY 'Enter User Name: '.
    ACCEPT WS-USER-NAME.
    DISPLAY 'Enter User Age: '.
    ACCEPT WS-USER-AGE.
    PERFORM 100-VALIDATE-USER.
    STOP RUN.

100-VALIDATE-USER.
    IF WS-USER-AGE < 18
        DISPLAY 'User is a minor.'
    ELSE
        DISPLAY 'User is an adult.'.